---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinksWarn
source: html/2c739221-fc59-0e48-4f6a-d3701b7c2982.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinksWarn Property

The links between connector [Index] and connector [Index], connector [Index] and connector [Index] are removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemoveConnectorLinksWarn { get; }
```